tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_i2c.h
/** @defgroup I2C_Exported_Constants I2C Exported Constants
  * @{
  */

/** @defgroup I2C_duty_cycle_in_fast_fast_plus_mode I2C duty cycle in fast or fast plus mode
  * @{
  */
#define I2C_DUTYCYCLE_2                 0x00000000U
#define I2C_DUTYCYCLE_16_9              I2C_CCR_DUTY
/**
  * @}
  */

/** @defgroup I2C_addressing_mode I2C addressing mode
  * @{
  */
#define I2C_ADDRESSINGMODE_7BIT         0x00000000U
#define I2C_ADDRESSINGMODE_10BIT        (I2C_OAR1_ADDMODE)
/**
  * @}
  */

/** @defgroup I2C_dual_addressing_mode  I2C dual addressing mode
  * @{
  */
#define I2C_DUALADDRESS_DISABLE        0x00000000U
#define I2C_DUALADDRESS_ENABLE         I2C_OAR2_ENDUAL
/**
  * @}
  */

/** @defgroup I2C_OWN_ADDRESS2_MASKS I2C Own Address2 Masks
  * @{
  */
#define I2C_OA2_NOMASK                  0x00000000U
#define I2C_OA2_MASK01                  (I2C_OAR2_OA2MSK_0)
#define I2C_OA2_MASK02                  (I2C_OAR2_OA2MSK_1)
#define I2C_OA2_MASK03                  (I2C_OAR2_OA2MSK_1 | I2C_OAR2_OA2MSK_0)
#define I2C_OA2_MASK04                  (I2C_OAR2_OA2MSK_2)
#define I2C_OA2_MASK05                  (I2C_OAR2_OA2MSK_2 | I2C_OAR2_OA2MSK_0)
#define I2C_OA2_MASK06                  (I2C_OAR2_OA2MSK_2 | I2C_OAR2_OA2MSK_1)
#define I2C_OA2_MASK07                  (I2C_OAR2_OA2MSK_2 | I2C_OAR2_OA2MSK_1 | I2C_OAR2_OA2MSK_0)
/**
  * @}
  */

/** @defgroup I2C_Triple_addressing_mode  I2C Triple addressing mode
  * @{
  */
#define I2C_TRIPLEADDRESS_DISABLE        0x00000000U
#define I2C_TRIPLEADDRESS_ENABLE         I2C_OAR3_ENTRIPLE
/**
  * @}
  */

/** @defgroup I2C_data_hold_time_sel I2C data hold time selection
  * @{
  */
#define I2C_DATA_HOLD_TIME_HARDWARE           0x00000000U
#define I2C_DATA_HOLD_TIME_SOFTWARE           I2C_TRISE_THOLDDATA_SEL
/**
  * @}
  */

/** @defgroup I2C_general_call_addressing_mode I2C general call addressing mode
  * @{
  */
#define I2C_GENERALCALL_DISABLE        0x00000000U
#define I2C_GENERALCALL_ENABLE         I2C_CR1_ENGC
/**
  * @}
  */

/** @defgroup I2C_nostretch_mode I2C nostretch mode
  * @{
  */
#define I2C_NOSTRETCH_DISABLE          0x00000000U
#define I2C_NOSTRETCH_ENABLE           I2C_CR1_NOSTRETCH
/**
  * @}
  */

/** @defgroup I2C_Memory_Address_Size I2C Memory Address Size
  * @{
  */
#define I2C_MEMADD_SIZE_8BIT            0x00000001U
#define I2C_MEMADD_SIZE_16BIT           0x00000010U
/**
  * @}
  */

/** @defgroup I2C_XferDirection_definition I2C XferDirection definition
  * @{
  */
#define I2C_DIRECTION_RECEIVE           0x00000000U
#define I2C_DIRECTION_TRANSMIT          0x00000001U
/**
  * @}
  */

/** @defgroup I2C_XferOptions_definition I2C XferOptions definition
  * @{
  */
#define  I2C_FIRST_FRAME                0x00000001U
#define  I2C_FIRST_AND_NEXT_FRAME       0x00000002U
#define  I2C_NEXT_FRAME                 0x00000004U
#define  I2C_FIRST_AND_LAST_FRAME       0x00000008U
#define  I2C_LAST_FRAME_NO_STOP         0x00000010U
#define  I2C_LAST_FRAME                 0x00000020U

/* List of XferOptions in usage of :
 * 1- Restart condition in all use cases (direction change or not)
 */
#define  I2C_OTHER_FRAME                (0x00AA0000U)
#define  I2C_OTHER_AND_LAST_FRAME       (0xAA000000U)
/**
  * @}
  */

/** @defgroup I2C_Interrupt_configuration_definition I2C Interrupt configuration definition
  * @brief I2C Interrupt definition
  *        Elements values convention: 0xXXXXXXXX
  *           - XXXXXXXX  : Interrupt control mask
  * @{
  */
#define I2C_IT_ERR                      I2C_CR2_ITERREN
#define I2C_IT_SB                       I2C_CR2_SBIE
#define I2C_IT_ADDR                     I2C_CR2_ADDRIE
#define I2C_IT_BTF                      I2C_CR2_BTFIE
#define I2C_IT_ADD10                    I2C_CR2_ADD10IE
#define I2C_IT_STOP                     I2C_CR2_STOPIE
#define I2C_IT_RX                       I2C_CR2_RXIE
#define I2C_IT_TX                       I2C_CR2_TXIE
#define I2C_IT_BUF                      (I2C_CR2_TXIE | I2C_CR2_RXIE)
#define I2C_IT_EVT                      (I2C_CR2_SBIE | I2C_CR2_ADDRIE | I2C_CR2_ADD10IE | I2C_CR2_STOPIE | I2C_CR2_BTFIE)
/**
  * @}
  */

/** @defgroup I2C_Flag_definition I2C Flag definition
  * @{
  */
#define I2C_FLAG_TIMEOUT                0x00004000U
#define I2C_FLAG_OVR                    0x00000800U
#define I2C_FLAG_AF                     0x00000400U
#define I2C_FLAG_ARLO                   0x00000200U
#define I2C_FLAG_BERR                   0x00000100U
#define I2C_FLAG_TXE                    0x00000080U
#define I2C_FLAG_RXNE                   0x00000040U
#define I2C_FLAG_STOPF                  0x00000010U
#define I2C_FLAG_ADD10                  0x00000008U
#define I2C_FLAG_BTF                    0x00000004U
#define I2C_FLAG_ADDR                   0x00000002U
#define I2C_FLAG_SB                     0x00000001U

#define I2C_FLAG_SBUSY                  0x00110000U
#define I2C_FLAG_DUALF                  0x00100080U
#define I2C_FLAG_GENCALL                0x00100010U
#define I2C_FLAG_TRIPLEF                0x00100008U
#define I2C_FLAG_TRA                    0x00100004U
#define I2C_FLAG_BUSY                   0x00100002U
#define I2C_FLAG_MSL                    0x00100001U
/**
  * @}
  */

/** @defgroup Wake_Up_Timeout_Clock_Prescaler Wake Up Timeout Clock Prescaler
  * @{
  */
#define I2C_WAKEUP_TIMEOUT_CLK_DIV_128                   0x00000000U                                 /*!< PCLK used for wake-up divided by 128 */
#define I2C_WAKEUP_TIMEOUT_CLK_DIV_256                   I2C_CR1_WKUP_DIV_0                          /*!< PCLK used for wake-up divided by 256 */
#define I2C_WAKEUP_TIMEOUT_CLK_DIV_512                   I2C_CR1_WKUP_DIV_1                          /*!< PCLK used for wake-up divided by 512 */
#define I2C_WAKEUP_TIMEOUT_CLK_DIV_1024                  (I2C_CR1_WKUP_DIV_1 | I2C_CR1_WKUP_DIV_0)   /*!< PCLK used for wake-up divided by 1024 */
/**
  * @} 
  */   

