tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_i2c.h
/** @defgroup Wake_Up_Timeout_Count Wake Up Timeout Count
  * @{
  */
#define I2C_WAKEUP_TIMEOUT_CNT_2                         0x00000000U                                 /*!< The number of timeout counts is 2 */
#define I2C_WAKEUP_TIMEOUT_CNT_8                         I2C_CR1_WKUP_CNT_0                          /*!< The number of timeout counts is 8 */
#define I2C_WAKEUP_TIMEOUT_CNT_32                        I2C_CR1_WKUP_CNT_1                          /*!< The number of timeout counts is 32 */
#define I2C_WAKEUP_TIMEOUT_CNT_128                       (I2C_CR1_WKUP_CNT_1 | I2C_CR1_WKUP_CNT_0)   /*!< The number of timeout counts is 128 */
/**
  * @} 
  */   
 
/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/

/** @defgroup I2C_Exported_Macros I2C Exported Macros
  * @{
  */

/** @brief Reset I2C handle state.
  * @param  __HANDLE__ specifies the I2C Handle.
  * @retval None
  */
#if (USE_HAL_I2C_REGISTER_CALLBACKS == 1)
#define __HAL_I2C_RESET_HANDLE_STATE(__HANDLE__)                do{                                                   \
                                                                    (__HANDLE__)->State = HAL_I2C_STATE_RESET;       \
                                                                    (__HANDLE__)->MspInitCallback = NULL;            \
                                                                    (__HANDLE__)->MspDeInitCallback = NULL;          \
                                                                  } while(0)
#else
#define __HAL_I2C_RESET_HANDLE_STATE(__HANDLE__)                ((__HANDLE__)->State = HAL_I2C_STATE_RESET)
#endif

/** @brief  Enable or disable the specified I2C interrupts.
  * @param  __HANDLE__ specifies the I2C Handle.
  * @param  __INTERRUPT__ specifies the interrupt source to enable or disable.
  *         This parameter can be one of the following values:
  *            @arg I2C_IT_TX:    Transmit data register empty interrupt enable
  *            @arg I2C_IT_RX:    Receive data register not empty interrupt enable
  *            @arg I2C_IT_STOP:  Stop bit check interrupt enable
  *            @arg I2C_IT_ADD10: 10bit address sent interrupt enable
  *            @arg I2C_IT_ADDR:  Address sent/matched interrupt enable
  *            @arg I2C_IT_SB:    Start bit interrupt enable
  *            @arg I2C_IT_BUF:   Buffer interrupt enable
  *            @arg I2C_IT_EVT:   Event interrupt enable
  *            @arg I2C_IT_ERR:   Error interrupt enable
  * @retval None
  */
#define __HAL_I2C_ENABLE_IT(__HANDLE__, __INTERRUPT__)   SET_BIT((__HANDLE__)->Instance->CR2,(__INTERRUPT__))
#define __HAL_I2C_DISABLE_IT(__HANDLE__, __INTERRUPT__)  CLEAR_BIT((__HANDLE__)->Instance->CR2, (__INTERRUPT__))

/** @brief  Checks if the specified I2C interrupt source is enabled or disabled.
  * @param  __HANDLE__ specifies the I2C Handle.
  * @param  __INTERRUPT__ specifies the I2C interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg I2C_IT_TX:    Transmit data register empty interrupt enable
  *            @arg I2C_IT_RX:    Receive data register not empty interrupt enable
  *            @arg I2C_IT_STOP:  Stop bit check interrupt enable
  *            @arg I2C_IT_ADD10: 10bit address sent interrupt enable
  *            @arg I2C_IT_ADDR:  Address sent/matched interrupt enable
  *            @arg I2C_IT_SB:    Start bit interrupt enable
  *            @arg I2C_IT_BUF:   Buffer interrupt enable
  *            @arg I2C_IT_EVT:   Event interrupt enable
  *            @arg I2C_IT_ERR:   Error interrupt enable
  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  */
#define __HAL_I2C_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((((__HANDLE__)->Instance->CR2 & (__INTERRUPT__)) == (__INTERRUPT__)) ? SET : RESET)

/** @brief  Checks whether the specified I2C flag is set or not.
  * @param  __HANDLE__ specifies the I2C Handle.
  * @param  __FLAG__ specifies the flag to check.
  *         This parameter can be one of the following values:
  *            @arg I2C_FLAG_TIMEOUT: wakeup timeout flag
  *            @arg I2C_FLAG_OVR: Overrun/Underrun flag
  *            @arg I2C_FLAG_AF: Acknowledge failure flag
  *            @arg I2C_FLAG_ARLO: Arbitration lost flag
  *            @arg I2C_FLAG_BERR: Bus error flag
  *            @arg I2C_FLAG_TXE: Data register empty flag
  *            @arg I2C_FLAG_RXNE: Data register not empty flag
  *            @arg I2C_FLAG_STOPF: Stop detection flag
  *            @arg I2C_FLAG_ADD10: 10-bit header sent flag
  *            @arg I2C_FLAG_BTF: Byte transfer finished flag
  *            @arg I2C_FLAG_ADDR: Address sent/matched flag
  *                                Address matched flag
  *            @arg I2C_FLAG_SB: Start bit flag
  *            @arg I2C_FLAG_SBUSY: Slave busy flag
  *            @arg I2C_FLAG_DUALF: Dual flag
  *            @arg I2C_FLAG_GENCALL: General call header flag
  *            @arg I2C_FLAG_TRIPLEF: Triple address flag
  *            @arg I2C_FLAG_TRA: Transmitter/Receiver flag
  *            @arg I2C_FLAG_BUSY: Bus busy flag
  *            @arg I2C_FLAG_MSL: Master/Slave flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_I2C_GET_FLAG(__HANDLE__, __FLAG__) ((((uint8_t)((__FLAG__) >> 16U)) == 0x00U) ? \
                                                  (((((__HANDLE__)->Instance->SR1) & ((__FLAG__) & I2C_FLAG_MASK)) == ((__FLAG__) & I2C_FLAG_MASK)) ? SET : RESET) : \
                                                  (((((__HANDLE__)->Instance->SR2) & ((__FLAG__) & I2C_FLAG_MASK)) == ((__FLAG__) & I2C_FLAG_MASK)) ? SET : RESET))

/** @brief  Clears the I2C pending flags which are cleared by writing 0 in a specific bit.
  * @param  __HANDLE__ specifies the I2C Handle.
  * @param  __FLAG__ specifies the flag to clear.
  *         This parameter can be any combination of the following values:
  *            @arg I2C_FLAG_TIMEOUT: wakeup timeout flag
  *            @arg I2C_FLAG_OVR: Overrun/Underrun flag (Slave mode)
  *            @arg I2C_FLAG_AF: Acknowledge failure flag
  *            @arg I2C_FLAG_ARLO: Arbitration lost flag (Master mode)
  *            @arg I2C_FLAG_BERR: Bus error flag
  * @retval None
  */
#define __HAL_I2C_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->SR1 = ~((__FLAG__) & I2C_FLAG_MASK))

